Strg-Alt-Entf-0x00/firered-vad-esp32-p4/examples/console_vad/sdkconfig.defaults
# ESP32-P4 Target
CONFIG_IDF_TARGET="esp32p4"

# ESP32-P4 Chip Revision Support
# This configuration supports ALL revisions: v1.0, v1.1, v1.3, and v3.x
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_0=y
CONFIG_ESP32P4_REV_MIN_FULL=0

# CPU Frequency (360 MHz for optimal DSP performance)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PSRAM (Required for FireVAD models)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_WATCHDOG_TIMEOUT_S=10

# Console
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# LittleFS
CONFIG_LITTLEFS_MAX_PARTITIONS=1

# I2S
CONFIG_I2S_ENABLE_DEBUG_LOG=n
